[
    {
        "id": 0,
        "title": "KuyStudy",
        "description": "KuyStudy is a concept application for the learning-with-teacher booking system.",
        "moreDescription": "KuyStudy is a conceptual application designed to facilitate the booking of learning sessions with teachers. This system aims to streamline the process of finding and scheduling educational sessions, making it easier for students to connect with qualified teachers. The project was developed as part of the GEMASTIK XIV competition in 2021.",
        "type": "GEMASTIK XIV",
        "year": 2021, 
        "coverImage": "/assets/projects/kuystudy-cover-image.jpg",
        "image1": "",
        "image2": "",
        "image3": "",
        "github": "", 
        "skillIcons": ["/assets/uiux-framed-icon.png", "/assets/figma-framed-icon.png"]
    },
    {
        "id": 1,   
        "title": "E-Commerce",
        "description": "E-Commerce is a concept of marketplace with a simple-clean design.",
        "moreDescription": "E-Commerce is a conceptual marketplace application that emphasizes a simple and clean design. This project was created as a class assignment in 2021, focusing on providing a user-friendly interface for buying and selling products online.",
        "type": "Class Assignment", 
        "year": 2021, 
        "coverImage": "/assets/projects/ecommerce-cover-image.jpg",
        "image1": "",
        "image2": "",
        "image3": "",
        "github": "", 
        "skillIcons": ["/assets/uiux-framed-icon.png", "/assets/figma-framed-icon.png"]
    },
    {
        "id": 2,
        "title": "PawMatch",
        "description": "PawMatch is a platform in the form of an Android application for users that have pets and want to match their pets.",
        "moreDescription": "PawMatch is an Android application designed for pet owners who want to find suitable matches for their pets. This platform allows users to create profiles for their pets and connect with other pet owners for potential matches. The project was developed as a final class assignment in 2023.",
        "type": "Final Class Assignment", 
        "year": 2023, 
        "coverImage": "/assets/projects/pawmatch-cover-image.jpg",
        "image1": "",
        "image2": "",
        "image3": "",
        "github": "", 
        "skillIcons": ["/assets/uiux-framed-icon.png", "/assets/figma-framed-icon.png", "/assets/react-framed-icon.png"]
    },
    {
        "id": 3,
        "title": "Persona",
        "description": "Persona is an Android application that brings personality identification system.",
        "moreDescription": "Persona is an Android application designed to assist teachers and parents in identifying and understanding children's personalities. This application leverages a personality identification system to provide insights and guidance, helping to foster better communication and support for children's development. The research behind this application is titled 'Child Personality Identification for Teacher and Parent Guidance', focusing on creating a tool that bridges the gap between educational and parental environments.",
        "type": "Thesis Project: Capstone Design", 
        "year": 2024, 
        "coverImage": "/assets/projects/persona-cover-image.jpg",
        "image1": "/assets/projects/persona-detail1.png",
        "image2": "",
        "image3": "",
        "github": "https://github.com/galihkarya/Persona_v0.0.3", 
        "skillIcons": ["/assets/uiux-framed-icon.png", "/assets/figma-framed-icon.png", "/assets/react-framed-icon.png", "/assets/ml-framed-icon.png"]
    }, 
    {
        "id": 4,
        "title": "Gals Portfolio",
        "description": "Gals Portfolio is a first personal portfolio website that showcases my works or projects.",
        "moreDescription": "Gals Portfolio is my first personal portfolio website that showcases my works and projects. This website was created as a self-project in 2024, focusing on providing a platform to share my experiences and skills with others. The website features a clean and modern design, highlighting my projects.",
        "type": "Self Project", 
        "year": 2024, 
        "coverImage": "/assets/projects/galsportfolio-cover-image.png",
        "image1": "",
        "image2": "",
        "image3": "",
        "github": "https://github.com/galihkarya/Portfolio-Website/tree/main/portfolio", 
        "skillIcons": ["/assets/uiux-framed-icon.png", "/assets/figma-framed-icon.png", "/assets/next-icon.png", "/assets/tailwindcss-icon.png"]
    }
]